OdDAI.OdDAIObjectSDAI.gsNode
\details
Retrieves the current Gs node object of the sdai object.
\returns Returns a raw pointer to the OdGsCache object associated with the sdai object.

OdDAI.OdDAIObjectSDAI.setGsNode(OdGsCache*)
\details
Sets a new Gs node cache for the sdai object.
\param pGsNode [in] A raw pointer to an OdGsCache object.

OdDAI.OdDAIObjectSDAI.id
\details
Retrieves the database object identifier of the sdai object.
\returns Returns the sdai object's database identifier.
\remarks
The method returns a NULL pointer if the sdai object is not persistent (i.e. not stored in a database).

OdDAI.OdDAIObjectSDAI.isPersistent
\details
Retrieves whether the sdai object is a persistent one.
\returns Returns true if the sdai object is a persistent one; otherwise, the method returns false.
\remarks
Persistent objects are database-resident objects (i.e. they are stored in a database).

OdDAI.OdDAIObjectSDAI.testAttrCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset in case insencitive mode.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.OdDAIObjectSDAI.testAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves whether the attribute value is set or is unset.
\param attribute [in] an attribute type.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.OdDAIObjectSDAI.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.OdDAIObjectSDAI.getAttrCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name in case insencitive mode.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.OdDAIObjectSDAI.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.OdDAIObjectSDAI.isKindOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the sdai object belongs to a certain entity type with a specified name.
\param entityName [in] A name of entities type.
\returns Returns true if the sdai object belongs to the type of entity with the specified name; otherwise, the method returns false.

OdDAI.OdDAIObjectSDAI.isInstanceOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the sdai object is an instance of an instance type with a specified name.
\param entityName [in] An entity's type name.
\returns Returns true if the sdai object is an instance of the specified type; otherwise, the method returns false.

OdDAI.OdDAIObjectSDAI.owningModel
\details
Retrieves the model that contains the sdai object.
\returns Returns a raw pointer to the owning model; if the sdai object is not appended to any model, the method returns a NULL pointer.